# Dictionaries

## List

From the below list find the index value of "Mangoes" and then using the index value find the quantity of mangoes.

In [ ]:
fruits = ["Apple", "Oranges", "Kiwi", "Mangoes", "Banana"]
Quantity = [7, 5, 10, 8, 3]

In [29]:
### START CODE HERE : 
fruits = ["Apple", "Oranges", "Kiwi", "Mangoes", "Banana"]
Quantity = [7, 5, 10, 8, 3]
M=fruits.index("Mangoes")
print(M)
Quantity[M]
### END CODE

3

8

Since these is not so convenient method so instead we use dictionary

## Dictionary

From the below dictionary find the quantity of "Banana"

In [2]:
dict = {"Apple":7, "Oranges":5, "Kiwi":10, "Mangoes":8, "Banana":3}

### START CODE HERE : 
B=dict["Banana"]
print(B)
### END CODE

3

Add "Plum" fruit with quantity 15 in the dict

In [4]:
### START CODE HERE : 
dict["Plum"]=15
print(dict)
### END CODE

{'Apple': 7, 'Oranges': 5, 'Kiwi': 10, 'Mangoes': 8, 'Banana': 3, 'Plum': 15}

In [5]:
# Check if "Banana" is present in dict

### START CODE HERE : 
"Banana" in dict
### END CODE

True

In [6]:
# Delete "Banana" from dict

### START CODE HERE : 
del(dict["Banana"])
print(dict)
### END CODE

{'Apple': 7, 'Oranges': 5, 'Kiwi': 10, 'Mangoes': 8, 'Plum': 15}

## Pandas

In [ ]:
df = {
    "Name": ["aparna", "pankaj", "sudhir", "Geeku", "Chiku", "Jeniffer"], 
    "Degree": ["Bsc", "Engineering", "Law", "MBBS", "Phd", "Nursing"],
    "College": ["VIT", "IIT", "KIIT", "AIMS", "IIIT", "APPOLO"],
    "Score": [90, 70, 80, 98, 76, 89]}

Using pandas convert the above df into DataFrame and read it

In [33]:
### START CODE HERE : 
df = {
    "Name": ["aparna", "pankaj", "sudhir", "Geeku", "Chiku", "Jeniffer"], 
    "Degree": ["Bsc", "Engineering", "Law", "MBBS", "Phd", "Nursing"],
    "College": ["VIT", "IIT", "KIIT", "AIMS", "IIIT", "APPOLO"],
    "Score": [90, 70, 80, 98, 76, 89]} 
import pandas as pd
college=pd.DataFrame(df)
print(college)
### END CODE

       Name       Degree College  Score
0    aparna          Bsc     VIT     90
1    pankaj  Engineering     IIT     70
2    sudhir          Law    KIIT     80
3     Geeku         MBBS    AIMS     98
4     Chiku          Phd    IIIT     76
5  Jeniffer      Nursing  APPOLO     89

In [3]:
type(college)

pandas.core.frame.DataFrame

Change the index value to ("B", "E", "L", "M", "P", "N") respectively for the dict

In [34]:
### START CODE HERE : 
college.index=["B","E","L","M","P","N"]
print(college)
### END CODE

       Name       Degree College  Score
B    aparna          Bsc     VIT     90
E    pankaj  Engineering     IIT     70
L    sudhir          Law    KIIT     80
M     Geeku         MBBS    AIMS     98
P     Chiku          Phd    IIIT     76
N  Jeniffer      Nursing  APPOLO     89

Solve the following question for Column Access:
    
    Q1. Access the column Name
    
    Q2. Find the type of the column Name
    
    Q3. Access two column (Name & Degree) at a time

In [35]:
### Q1. START CODE HERE :
college[["Name"]]
### END CODE

       Name
B    aparna
E    pankaj
L    sudhir
M     Geeku
P     Chiku
N  Jeniffer

In [10]:
### Q2. START CODE HERE : 
type("Name")
### END CODE

str

In [37]:
### Q3. START CODE HERE : 
college[["Name","Degree"]]
### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing

Solve for Row Access:
    
    Q1. Access first three rows of dict
    
    Q2. Access rows from second to fourth row

In [42]:
### Q1. START CODE HERE : 
college[0:3]
### END CODE

     Name       Degree College  Score
B  aparna          Bsc     VIT     90
E  pankaj  Engineering     IIT     70
L  sudhir          Law    KIIT     80

In [45]:
### Q2. START CODE HERE : 
college[1:4]
### END CODE

     Name       Degree College  Score
E  pankaj  Engineering     IIT     70
L  sudhir          Law    KIIT     80
M   Geeku         MBBS    AIMS     98

Use the **.loc** function to solve below questions:

   Q1. Access the **B** row

   Q2. Access **B , M & L** row at once

   Q3. Access **B , M** row & **Name , Score** column

   Q4. Access all row with just **Name & Degree** column

In [46]:
### Q1. START CODE HERE : 
college.loc[["B"]]
### END CODE

     Name Degree College  Score
B  aparna    Bsc     VIT     90

In [48]:
### Q2. START CODE HERE : 
college.loc[["B","M","L"]]
### END CODE

     Name Degree College  Score
B  aparna    Bsc     VIT     90
M   Geeku   MBBS    AIMS     98
L  sudhir    Law    KIIT     80

In [51]:
### Q3. START CODE HERE : 
college.loc[["B","M"],["Name","Score"]]
### END CODE

     Name  Score
B  aparna     90
M   Geeku     98

In [52]:
### Q4. START CODE HERE : 
college.loc[:,["Name","Degree"]]
### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing

Use .iloc function to solve the following questions:

Q1. Access the 3rd row

Q2. Access the first 3 row

Q3. Access first 3 row and first 3 column

Q4. Access all row with name & Degree column

In [56]:
### Q1. START CODE HERE : 
college.iloc[[2]]
### END CODE

     Name Degree College  Score
L  sudhir    Law    KIIT     80

In [ ]:
here, L is 3rd row. So I have access the L using its index 2

In [58]:
### Q2. START CODE HERE : 
college.iloc[[0,1,2]]
### END CODE

     Name       Degree College  Score
B  aparna          Bsc     VIT     90
E  pankaj  Engineering     IIT     70
L  sudhir          Law    KIIT     80

In [59]:
### Q3. START CODE HERE : 
college.iloc[[0,1,2],[0,1,2]]
### END CODE

     Name       Degree College
B  aparna          Bsc     VIT
E  pankaj  Engineering     IIT
L  sudhir          Law    KIIT

In [61]:
### Q4. START CODE HERE : 
college.iloc[:,[0,1]]
### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing